Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.LoadsBCsInnerContoursDeletedDuringSplit Property
 During the split process, the interior contours of unconstrained area loads and boundary conditions were removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoadsBCsInnerContoursDeletedDuringSplit { get; }
Public Shared ReadOnly Property LoadsBCsInnerContoursDeletedDuringSplit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoadsBCsInnerContoursDeletedDuringSplit {
	FailureDefinitionId^ get ();
}
static member LoadsBCsInnerContoursDeletedDuringSplit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace